{
  "Основы ML и Практика Python": [
    {
      "name": "CS42_Python_Sequences.pdf",
      "path": "materials/_ML_Python/CS42_Python_Sequences.pdf",
      "size": 10523956,
      "mime": "application/pdf",
      "uploader": "Student",
      "note": "The Zen of Python, by Tim Peters",
      "ts": 1757275283,
      "annotation": "Материал знакомит с философией Python и системой пространств имен в языке. Рассматриваются ключевые концепции: области видимости, привязки имен к значениям и принципы работы с переменными. Эти знания помогут студентам писать более читаемый код и избегать распространенных ошибок при работе с переменными в разных контекстах."
    },
    {
      "name": "_-2.pdf",
      "original_name": "ИИБТ-2.pdf",
      "path": "materials\\_ML_Python\\_-2.pdf",
      "size": 11222853,
      "mime": "application/pdf",
      "uploader": "egor2",
      "note": "лекция 2",
      "ts": 1757643614,
      "annotation": "Данный материал посвящен машинному обучению в материаловедении с акцентом на создании дескрипторов для предсказания свойств материалов. Ключевые концепции включают one-hot encoding, SMILES-нотацию и дескрипторы теории функционала плотности для представления химических структур. Материал имеет практическую ценность для исследователей, работающих с прогнозированием свойств материалов и разработкой новых соединений с помощью методов машинного обучения."
    },
    {
      "name": "_.pdf",
      "original_name": "ИИБТ.pdf",
      "path": "materials\\_ML_Python\\_.pdf",
      "size": 2522178,
      "mime": "application/pdf",
      "uploader": "egor2",
      "note": "лекция 1",
      "ts": 1757643622,
      "annotation": "Курс посвящен применению искусственного интеллекта в биотехнологии с акцентом на освоение программирования на Python, методов анализа данных и машинного обучения. Ключевые темы включают обработку химических данных, статистику, визуализацию и нейронные сети. Практическая ценность заключается в получении навыков, необходимых для автоматизации исследований и анализа в биотехнологической сфере."
    }
  ],
  "Физика": [
    {
      "name": "_-3.pptx",
      "original_name": "ИИБТ-3.pptx",
      "path": "materials\\_\\_-3.pptx",
      "size": 1219703,
      "mime": "application/vnd.openxmlformats-officedocument.presentationml.presentation",
      "uploader": "egor2",
      "note": "11",
      "ts": 1757644906,
      "annotation": "Материал знакомит с библиотеками PubChemPy и RDKit для работы с химическими данными в Python. Рассматриваются ключевые функции: поиск веществ, работа с молекулярными дескрипторами, анализ свойств и структур молекул. Практическая ценность заключается в автоматизации химических расчетов и обработке данных для исследований в области химической информатики."
    },
    {
      "name": "_.pdf",
      "original_name": "ИИБТ.pdf",
      "path": "materials\\_\\_.pdf",
      "size": 2522178,
      "mime": "application/pdf",
      "uploader": "egor2",
      "note": "112",
      "ts": 1757644945,
      "annotation": "Курс знакомит с применением искусственного интеллекта в биотехнологии, охватывая основы программирования на Python, обработку данных и машинное обучение. Ключевые темы включают работу с химическими данными, статистический анализ и нейронные сети. Практическая ценность заключается в получении навыков для автоматизации исследований и анализа биотехнологических данных с использованием современных ИИ-инструментов."
    }
  ],
  "egor": [],
  "General": [],
  "Тест": []
}